#encoding:utf-8
class ColorCode < ActiveRecord::Base
  attr_accessible :code, :name, :rgb
  belongs_to :design
  SNCOLOR = [["#fdf1d9;","荷兰乳酪","NN3401-4"],["#f7f3e8;","贝壳白","NN1507-4"],["#c3b79f;","细沙海岸","NN2520-3"],["#b4b1ac;","银烛台","NN1370-3"],["#c3b79f;","黑巧克力","NN2500-1"],
            ["#fcfbf6;","石膏岩","NN1307-4"],["#fcedda;","樱花彩","NN1801-4"],["#ac8b78;","印度褐","NN1270-3"],["#f6eee1;","护花使者","NN1107-4"],["#724e40;","玛瑙","NN1100-1"]]
  MMCOLOR = [["#fef8e8;","虔诚","YN3007-4"],["#f9c035;","幸运彩","YC2820-3"],["#fdd9a7;","稻花香","NN3410-4"],["#ecefe4;","寒江冷月","GN5207-4"],["#943438;","勃艮地红","RA0700-1"],
			["#e5edf0;","冬日黄昏","VC7008-4"],["#97a3a3;","企鹅","NN6520-3"],["#5e7070;","忧郁","NN6540-4"],["#f5f1ee;","渴望","VC7208-4"],["#313b3c;","魔力黑","NN6500-1"]]
  SSCOLOR = [["#f1f6e0;","淡荷彩","GC5301-4"],["#eeecd5;","水色天光","NN6501-4"],["#fffaea;","黄飘带","YC2807-4"],["#c0c755;","绿野仙踪","GC4080-2"],["#757a76;","岩灰","NN1390-2"],
  			["#edecea;","蝴蝶兰","NN7201-4"],["#f1f8f1;","蟹壳青","OW058-4"],["#cde3e1;","牛津纺","BC6351-4"],["#e3d6df;","西洋丁香","VN0151-4"],["#703a52;","红高粱","VA0200-1"]]
  CBCOLOR = [["#f1f6e0;","平静海风","BC6708-4"],["#e8e6f3;","香芋奶昔","VC0035-4"],["#d9edf8;","细雨","BC0017-4"],["#aad6f1;","挪威蓝","BC6810-4"],["#5265a0;","紫丁香","VC7030-2"],
  			["#eff2a5;","春意盎然","GC4110-3"],["#73c0d2;","霸王花","BC6620-3"],["#ad9cc0;","寂静繁星","VC7270-3"],["#edf0f9;","紫蔓","VC0003-4"],["#05377c;","蝶恋花","BA7000-1"]]
  PPCOLOR = [["#feecea;","欢乐","RN0507-4"],["#c9e8e3;","海之女","GC5751-4"],["#fbf19c;","报春花","YC3220-3"],["#f8f7c1;","北极春","YC3210-4"],["#fad3cc;","红颜知己","OC1510-4"],
  			["#e68a99;","甜蜜新娘","RC0530-2"],["#f0c7d9;","羞答答","RC0310-4"],["#d8dd7f;","野性大自然","GC4060-3"],["#35ad80;","锦茵","GC5540-2"],["#e3eeb6;","春意融融","GC4310-4"]]
  GACOLOR = [["#fffaf4;","象牙白","OW038-4"],["#d41e2d;","番茄汁","RA1500-1"],["#f8ba6d;","橘碧彩","ON1930-2"],["#e9dabb;","锡兰象牙","NN4760-4"],["#f4cf39;","炫目","YA3200-1"],
  			["#f5e7b8;","切尔沙的世界","NN4851-4"],["#dc7b6b;","西班牙女郎","OC1540-2"],["#fdd9a5;","烛光摇曳","ON1910-4"],["#107a78;","夏威夷","BA5800-1"],["#0e7387;","深海蓝","BA6600-1"]]
end
