# -*- encoding : utf-8 -*-
class Score < ActiveRecord::Base
	ScoreType = {
		101 => "注册",  
		102 => "完善资料",
		200 => "邀请",
		300 => "登录",
		400 => "官微关注",
		500 => "分享Qzone",
		501 => "分享Weibo",
		502 => "分享Renren",
		503 => "分享Kaixin001",
		601 => "发布作品",
		602 => "发布灵感秀",
		701 => "Design投票",
		702 => "Inspiration投票",
		711 => "Design被投票",
		712 => "Inspiration被投票",
		801 => "作品评论",
		802 => "每周之星评论",
		803 => "灵感秀评论",
		804 => "实用工具评论",
		811 => "作品被评论",
		813 => "灵感秀被评论",
		900 => "每周之星",
		1001 => "提问",
		1002 => "回答",
		1100 => "在线配色",
		1200 => "获得认证",
		1300 => "发起活动",
		1301 => "活动人数大于50",
		1400 => "其他"
	}

	ScoreLevel = [0, 5000, 10000]

	LevelName = ["普通会员", "银牌会员", "金牌会员"]
	
	belongs_to :user

end
